qnimble/ArduinoCore-iMXRT/imxrt/startup.c
       // Load base address of Global Section Table
       SectionTableAddr = &__data_section_table;

       // Copy the data sections from flash to SRAM.
       while (SectionTableAddr < &__data_section_table_end) {
               LoadAddr = *SectionTableAddr++;
               ExeAddr = *SectionTableAddr++;
               SectionLen = *SectionTableAddr++;
               data_init(LoadAddr, ExeAddr, SectionLen);
       }

       // At this point, SectionTableAddr = &__bss_section_table;
       // Zero fill the bss segment
       while (SectionTableAddr < &__bss_section_table_end) {
               ExeAddr = *SectionTableAddr++;
               SectionLen = *SectionTableAddr++;
               bss_init(ExeAddr, SectionLen);
       }
}

FLASHMEM void configure_pins(void) {

        /* GPIO_SD_B1_05 as FLEXSPIA_DQS */
        IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_05     = 0x11;
        IOMUXC_FLEXSPIA_DQS_SELECT_INPUT = 0;

        /* GPIO_SD_B1_06 as FLEXSPIA_SS0_B */
        IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_06     = 0x11;

        /* GPIO_SD_B1_07 as FLEXSPIA_SCLK */
        IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_07     = 0x11;
        IOMUXC_FLEXSPIA_SCK_SELECT_INPUT = 0;

        /* GPIO_SD_B1_08 as FLEXSPIA_DATA00 */
        IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_08     = 0x11;
        IOMUXC_FLEXSPIA_DATA0_SELECT_INPUT = 0;

        /* GPIO_SD_B1_09 as FLEXSPIA_DATA01 */
        IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_09     = 0x11;
        IOMUXC_FLEXSPIA_DATA1_SELECT_INPUT = 0;

        /* GPIO_SD_B1_10 as FLEXSPIA_DATA02 */
        IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_10     = 0x11;
        IOMUXC_FLEXSPIA_DATA2_SELECT_INPUT = 0;

        /* GPIO_SD_B1_11 as FLEXSPIA_DATA03 */
        IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_11     = 0x11;
        IOMUXC_FLEXSPIA_DATA3_SELECT_INPUT = 0;


         /* Set the following pins to:
                 Drive Strength Field: R0/6
                 Speed Field: max(200MHz)
                 Open Drain Enable Field: Open Drain Disabled
                 Pull / Keep Enable Field: Pull/Keeper Enabled
                 Pull / Keep Select Field: Keeper
                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                 Hyst. Enable Field: Hysteresis Disabled */

        IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05 = 0x10F1u;
        IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06 = 0x10F1u;
        IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07 = 0x10F1u;
        IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08 = 0x10F1u;
        IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09 = 0x10F1u;
        IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10 = 0x10F1u;
        IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11 = 0x10F1u;

        IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_00 = 0x15;
		IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_01 = 0x15;
		IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_02 = 0x15;
		IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_03 = 0x15;
		IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_04 = 0x15;
		IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_05 = 0x15;
        IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_09 = 0x15;

        IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_00 = 0x15; //set LED pins as GPIO, in case set to PWM previously
        IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_01 = 0x15;
        IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_02 = 0x15;

        GPIO8_GDIR = 0x07; //Set LEDs as outputs
        GPIO8_DR_CLEAR = 0x07; //Turn off LED
        GPIO7_GDIR = 0xFFFFF; //Set DAC Update pins as outputs
        GPIO6_GDIR = 0x30; //Set BM as outputs for Read / ADC ACK

}





// concise defines for SCB_MPU_RASR and SCB_MPU_RBAR, ARM DDI0403E, pg 696
#define NOEXEC		SCB_MPU_RASR_XN
#define READONLY	SCB_MPU_RASR_AP(7)
#define READWRITE	SCB_MPU_RASR_AP(3)
#define NOACCESS	SCB_MPU_RASR_AP(0)
#define MEM_CACHE_WT	SCB_MPU_RASR_TEX(0) | SCB_MPU_RASR_C
#define MEM_CACHE_WB	SCB_MPU_RASR_TEX(0) | SCB_MPU_RASR_C | SCB_MPU_RASR_B
#define MEM_CACHE_WBWA	SCB_MPU_RASR_TEX(1) | SCB_MPU_RASR_C | SCB_MPU_RASR_B
#define MEM_NOCACHE	SCB_MPU_RASR_TEX(1)
#define DEV_NOCACHE	SCB_MPU_RASR_TEX(2)
#define SIZE_32B	(SCB_MPU_RASR_SIZE(4) | SCB_MPU_RASR_ENABLE)
#define SIZE_64B	(SCB_MPU_RASR_SIZE(5) | SCB_MPU_RASR_ENABLE)
#define SIZE_128B	(SCB_MPU_RASR_SIZE(6) | SCB_MPU_RASR_ENABLE)
#define SIZE_256B	(SCB_MPU_RASR_SIZE(7) | SCB_MPU_RASR_ENABLE)
#define SIZE_512B	(SCB_MPU_RASR_SIZE(8) | SCB_MPU_RASR_ENABLE)
#define SIZE_1K		(SCB_MPU_RASR_SIZE(9) | SCB_MPU_RASR_ENABLE)
#define SIZE_2K		(SCB_MPU_RASR_SIZE(10) | SCB_MPU_RASR_ENABLE)
#define SIZE_4K		(SCB_MPU_RASR_SIZE(11) | SCB_MPU_RASR_ENABLE)
#define SIZE_8K		(SCB_MPU_RASR_SIZE(12) | SCB_MPU_RASR_ENABLE)
#define SIZE_16K	(SCB_MPU_RASR_SIZE(13) | SCB_MPU_RASR_ENABLE)
#define SIZE_32K	(SCB_MPU_RASR_SIZE(14) | SCB_MPU_RASR_ENABLE)
#define SIZE_64K	(SCB_MPU_RASR_SIZE(15) | SCB_MPU_RASR_ENABLE)
#define SIZE_128K	(SCB_MPU_RASR_SIZE(16) | SCB_MPU_RASR_ENABLE)
#define SIZE_256K	(SCB_MPU_RASR_SIZE(17) | SCB_MPU_RASR_ENABLE)
#define SIZE_512K	(SCB_MPU_RASR_SIZE(18) | SCB_MPU_RASR_ENABLE)
#define SIZE_1M		(SCB_MPU_RASR_SIZE(19) | SCB_MPU_RASR_ENABLE)
#define SIZE_2M		(SCB_MPU_RASR_SIZE(20) | SCB_MPU_RASR_ENABLE)
#define SIZE_4M		(SCB_MPU_RASR_SIZE(21) | SCB_MPU_RASR_ENABLE)
#define SIZE_8M		(SCB_MPU_RASR_SIZE(22) | SCB_MPU_RASR_ENABLE)
#define SIZE_16M	(SCB_MPU_RASR_SIZE(23) | SCB_MPU_RASR_ENABLE)
#define SIZE_32M	(SCB_MPU_RASR_SIZE(24) | SCB_MPU_RASR_ENABLE)
#define SIZE_64M	(SCB_MPU_RASR_SIZE(25) | SCB_MPU_RASR_ENABLE)
#define SIZE_128M	(SCB_MPU_RASR_SIZE(26) | SCB_MPU_RASR_ENABLE)
#define SIZE_256M	(SCB_MPU_RASR_SIZE(27) | SCB_MPU_RASR_ENABLE)
#define SIZE_512M	(SCB_MPU_RASR_SIZE(28) | SCB_MPU_RASR_ENABLE)
#define SIZE_1G		(SCB_MPU_RASR_SIZE(29) | SCB_MPU_RASR_ENABLE)
#define SIZE_2G		(SCB_MPU_RASR_SIZE(30) | SCB_MPU_RASR_ENABLE)
#define SIZE_4G		(SCB_MPU_RASR_SIZE(31) | SCB_MPU_RASR_ENABLE)
#define REGION(n)	(SCB_MPU_RBAR_REGION(n) | SCB_MPU_RBAR_VALID)

FLASHMEM void configure_cache(void)
{
	//printf("MPU_TYPE = %08lX\n", SCB_MPU_TYPE);
	//printf("CCR = %08lX\n", SCB_CCR);

	// TODO: check if caches already active - skip?

	SCB_MPU_CTRL = 0; // turn off MPU

	uint32_t i = 0;
	SCB_MPU_RBAR = 0x00000000 | REGION(i++); //https://developer.arm.com/docs/146793866/10/why-does-the-cortex-m7-initiate-axim-read-accesses-to-memory-addresses-that-do-not-fall-under-a-defined-mpu-region
	SCB_MPU_RASR = SCB_MPU_RASR_TEX(0) | NOACCESS | NOEXEC | SIZE_4G;
	
