qnimble/ArduinoCore-iMXRT/imxrt/startup.c
	// RX watermark = one 64 bit line
	FLEXSPI2_IPRXFCR = (FLEXSPI_IPRXFCR & 0xFFFFFFC0) | FLEXSPI_IPRXFCR_CLRIPRXF;
	// TX watermark = one 64 bit line
	FLEXSPI2_IPTXFCR = (FLEXSPI_IPTXFCR & 0xFFFFFFC0) | FLEXSPI_IPTXFCR_CLRIPTXF;

	FLEXSPI2_INTEN = 0;
	FLEXSPI2_FLSHA1CR0 = 0x2000; // 8 MByte
	FLEXSPI2_FLSHA1CR1 = FLEXSPI_FLSHCR1_CSINTERVAL(2)
		| FLEXSPI_FLSHCR1_TCSH(3) | FLEXSPI_FLSHCR1_TCSS(3);
	FLEXSPI2_FLSHA1CR2 = FLEXSPI_FLSHCR2_AWRSEQID(6) | FLEXSPI_FLSHCR2_AWRSEQNUM(0)
		| FLEXSPI_FLSHCR2_ARDSEQID(5) | FLEXSPI_FLSHCR2_ARDSEQNUM(0);

	FLEXSPI2_FLSHA2CR0 = 0x2000; // 8 MByte
	FLEXSPI2_FLSHA2CR1 = FLEXSPI_FLSHCR1_CSINTERVAL(2)
		| FLEXSPI_FLSHCR1_TCSH(3) | FLEXSPI_FLSHCR1_TCSS(3);
	FLEXSPI2_FLSHA2CR2 = FLEXSPI_FLSHCR2_AWRSEQID(6) | FLEXSPI_FLSHCR2_AWRSEQNUM(0)
		| FLEXSPI_FLSHCR2_ARDSEQID(5) | FLEXSPI_FLSHCR2_ARDSEQNUM(0);

	FLEXSPI2_MCR0 &= ~FLEXSPI_MCR0_MDIS;

	FLEXSPI2_LUTKEY = FLEXSPI_LUTKEY_VALUE;
	FLEXSPI2_LUTCR = FLEXSPI_LUTCR_UNLOCK;
	volatile uint32_t *luttable = &FLEXSPI2_LUT0;
	for (int i=0; i < 64; i++) luttable[i] = 0;
	FLEXSPI2_MCR0 |= FLEXSPI_MCR0_SWRESET;
	while (FLEXSPI2_MCR0 & FLEXSPI_MCR0_SWRESET) ; // wait

	FLEXSPI2_LUTKEY = FLEXSPI_LUTKEY_VALUE;
	FLEXSPI2_LUTCR = FLEXSPI_LUTCR_UNLOCK;

	// cmd index 0 = exit QPI mode
	FLEXSPI2_LUT0 = LUT0(CMD_SDR, PINS4, 0xF5);
	// cmd index 1 = reset enable
	FLEXSPI2_LUT4 = LUT0(CMD_SDR, PINS1, 0x66);
	// cmd index 2 = reset
	FLEXSPI2_LUT8 = LUT0(CMD_SDR, PINS1, 0x99);
	// cmd index 3 = read ID bytes
	FLEXSPI2_LUT12 = LUT0(CMD_SDR, PINS1, 0x9F) | LUT1(DUMMY_SDR, PINS1, 24);
	FLEXSPI2_LUT13 = LUT0(READ_SDR, PINS1, 1);
	// cmd index 4 = enter QPI mode
	FLEXSPI2_LUT16 = LUT0(CMD_SDR, PINS1, 0x35);
	// cmd index 5 = read QPI
	FLEXSPI2_LUT20 = LUT0(CMD_SDR, PINS4, 0xEB) | LUT1(ADDR_SDR, PINS4, 24);
	FLEXSPI2_LUT21 = LUT0(DUMMY_SDR, PINS4, 6) | LUT1(READ_SDR, PINS4, 1);
	// cmd index 6 = write QPI
	FLEXSPI2_LUT24 = LUT0(CMD_SDR, PINS4, 0x38) | LUT1(ADDR_SDR, PINS4, 24);
	FLEXSPI2_LUT25 = LUT0(WRITE_SDR, PINS4, 1);

	// look for the first PSRAM chip
	flexspi2_command(0, 0); // exit quad mode
	flexspi2_command(1, 0); // reset enable
	flexspi2_command(2, 0); // reset (is this really necessary?)
	if (flexspi2_psram_id(0) == 0x5D0D) {
		// first PSRAM chip is present, look for a second PSRAM chip
		flexspi2_command(4, 0);
		flexspi2_command(0, 0x800000); // exit quad mode
		flexspi2_command(1, 0x800000); // reset enable
		flexspi2_command(2, 0x800000); // reset (is this really necessary?)
		if (flexspi2_psram_id(0x800000) == 0x5D0D) {
			flexspi2_command(4, 0x800000);
			// Two PSRAM chips are present, 16 MByte
			external_psram_size = 16;
		} else {
			// One PSRAM chip is present, 8 MByte
			external_psram_size = 8;
		}
		// TODO: zero uninitialized EXTMEM variables
		// TODO: copy from flash to initialize EXTMEM variables
		// TODO: set up for malloc_extmem()
	} else {
		// No PSRAM
	}
}

#elif defined(ARDUINO_QUARTO)

void adc1_irq_ignoredata(void);
void adc1_irq_ignoredata(void){
	ADC1_ISR = ADC1_BM; // Clear Interrupt
	GPIO6_DR_TOGGLE = 0x100; // Dummy GPIO write - necessary delay to avoid double firing
	ADC_ACK_BANK_TOGGLE = ADC_ACK_PIN; // ACK ADC Data
	GPIO6_DR_TOGGLE = 0x100; // Dummy GPIO write - necessary delay to avoid double firing
	return;
}

void adc2_irq_ignoredata(void) {
	ADC2_ISR = ADC2_BM; // Clear Interrupt
	GPIO6_DR_TOGGLE = 0x100; // Dummy GPIO write - necessary delay to avoid double firing
	ADC_ACK_BANK_TOGGLE = ADC_ACK_PIN; // ACK ADC Data
	GPIO6_DR_TOGGLE = 0x100; // Dummy GPIO write - necessary delay to avoid double firing
}

void adc3_irq_ignoredata(void) {
	ADC3_ISR = ADC3_BM; // Clear Interrupt
	GPIO6_DR_TOGGLE = 0x100; // Dummy GPIO write - necessary delay to avoid double firing
	ADC_ACK_BANK_TOGGLE = ADC_ACK_PIN; // ACK ADC Data
	GPIO6_DR_TOGGLE = 0x100; // Dummy GPIO write - necessary delay to avoid double firing

}

void adc4_irq_ignoredata(void) {
	ADC4_ISR = ADC4_BM; // Clear Interrupt
	GPIO6_DR_TOGGLE = 0x100; // Dummy GPIO write - necessary delay to avoid double firing
	ADC_ACK_BANK_TOGGLE = ADC_ACK_PIN; // ACK ADC Data
	GPIO6_DR_TOGGLE = 0x100; // Dummy GPIO write - necessary delay to avoid double firing

}

FLASHMEM void quarto_init(void) {
	GPIO7_DR_TOGGLE = (0x000B0000 + 0x010); //Set Write address to 0x010 for Enabling Analog

	//Clear stale Data if available.
	READDATA_ACK_BANK_TOGGLE = READDATA_ACK_PIN; // Ack Read Data
	ADC_ACK_BANK_TOGGLE = ADC_ACK_PIN; // ACK ADC Data

	GPIO7_DR_TOGGLE = (0x000D0000 + 0x03); //Enable Analog Clock, Analog,

	delay(50);

	GPIO7_DR_TOGGLE = 0x00010000; //Set DAC1 to 0x0000 or 0V

	//Clear stale Data if available.
	READDATA_ACK_BANK_TOGGLE = READDATA_ACK_PIN; // Ack Read Data
	ADC_ACK_BANK_TOGGLE = ADC_ACK_PIN; // ACK ADC Data

	GPIO7_DR_TOGGLE = 0x00030000; //Set DAC2 to 0x0000 or 0V

	//Clear stale Data if available.
	READDATA_ACK_BANK_TOGGLE = READDATA_ACK_PIN; // Ack Read Data
	ADC_ACK_BANK_TOGGLE = ADC_ACK_PIN; // ACK ADC Data

	GPIO7_DR_TOGGLE = 0x00050000; //Set DAC3 to 0x0000 or 0V

	//Clear stale Data if available.
	READDATA_ACK_BANK_TOGGLE = READDATA_ACK_PIN; // Ack Read Data
	ADC_ACK_BANK_TOGGLE = ADC_ACK_PIN; // ACK ADC Data

	GPIO7_DR_TOGGLE = 0x00070000; //Set DAC4 to 0x0000 or 0V

	//Clear stale Data if available.
	READDATA_ACK_BANK_TOGGLE = READDATA_ACK_PIN; // Ack Read Data
	ADC_ACK_BANK_TOGGLE = ADC_ACK_PIN; // ACK ADC DataGPIO6_DR_TOGGLE = 0x00000020; // Toggle Read Data ACK

	delay(1);

	GPIO7_DR_TOGGLE = (0x000D0000 + 0x07); //Enable Vref.

	//Clear stale Data if available.
	READDATA_ACK_BANK_TOGGLE = READDATA_ACK_PIN; // Ack Read Data
	ADC_ACK_BANK_TOGGLE = ADC_ACK_PIN; // ACK ADC Data

	// Configure ADC Interrupts to basic ISRs that ack data to keep stream going
	__asm volatile ("cpsid i");

	NVIC_SET_PRIORITY(ADC1_IRQ, 8);
	NVIC_SET_PRIORITY(ADC2_IRQ, 24);
	NVIC_SET_PRIORITY(ADC3_IRQ, 40);
	NVIC_SET_PRIORITY(ADC4_IRQ, 56);

	GPIO1_ICR1 &= ~ ( (0x2)<<(2*ADC1_PIN) );
	GPIO1_ICR1 |= ( (0x2)<<(2*ADC1_PIN) );
	GPIO1_ICR1 &= ~ ( (0x2)<<(2*ADC2_PIN) );
	GPIO1_ICR1 |= ( (0x2)<<(2*ADC2_PIN) );
	GPIO3_ICR1 &= ~ ( (0x2)<<(2*ADC3_PIN) );
	GPIO3_ICR1 |= ( (0x2)<<(2*ADC3_PIN) );
	GPIO2_ICR2 &= ~ ( (0x2)<<(ADC4_PIN-1) );  //bit shift by 31*2 mod 32 is 30, or 31-1.
	GPIO2_ICR2 |= ( (0x2)<<(ADC4_PIN-1) );    //bit shift by 31*2 mod 32 is 30, or 31-1.

	ADC1_IMR |= ADC1_BM; //Enable ADC1 Interrupt Pin
	ADC2_IMR |= ADC2_BM; //Enable ADC2 Interrupt Pin
	ADC3_IMR |= ADC3_BM; //Enable ADC3 Interrupt Pin
	ADC4_IMR |= ADC4_BM; //Enable ADC4 Interrupt Pin

	attachInterruptVector(ADC1_IRQ, &adc1_irq_ignoredata);
	attachInterruptVector(ADC2_IRQ, &adc2_irq_ignoredata);
	attachInterruptVector(ADC3_IRQ, &adc3_irq_ignoredata);
	attachInterruptVector(ADC4_IRQ, &adc4_irq_ignoredata);

	NVIC_ENABLE_IRQ(ADC1_IRQ);
	NVIC_ENABLE_IRQ(ADC2_IRQ);
	NVIC_ENABLE_IRQ(ADC3_IRQ);
	NVIC_ENABLE_IRQ(ADC4_IRQ);

	GPIO7_DR_TOGGLE = (0x000B0000 + 0x03FFF); //Magic Command to Reset ADC/DAC Data

	__asm volatile ("cpsie i");

	quarto_wdog_init(635); // turn on wdog
}
#endif


FLASHMEM void usb_pll_start()
{
	while (1) {
		uint32_t n = CCM_ANALOG_PLL_USB1; // pg 759
		printf("CCM_ANALOG_PLL_USB1=%08lX\n", n);
		if (n & CCM_ANALOG_PLL_USB1_DIV_SELECT) {
			printf("  ERROR, 528 MHz mode!\n"); // never supposed to use this mode!
			CCM_ANALOG_PLL_USB1_CLR = 0xC000;			// bypass 24 MHz
			CCM_ANALOG_PLL_USB1_SET = CCM_ANALOG_PLL_USB1_BYPASS;	// bypass
			CCM_ANALOG_PLL_USB1_CLR = CCM_ANALOG_PLL_USB1_POWER |	// power down
				CCM_ANALOG_PLL_USB1_DIV_SELECT |		// use 480 MHz
				CCM_ANALOG_PLL_USB1_ENABLE |			// disable
				CCM_ANALOG_PLL_USB1_EN_USB_CLKS;		// disable usb
			continue;
		}
		if (!(n & CCM_ANALOG_PLL_USB1_ENABLE)) {
			printf("  enable PLL\n");
			// TODO: should this be done so early, or later??
			CCM_ANALOG_PLL_USB1_SET = CCM_ANALOG_PLL_USB1_ENABLE;
			continue;
		}
		if (!(n & CCM_ANALOG_PLL_USB1_POWER)) {
			printf("  power up PLL\n");
			CCM_ANALOG_PLL_USB1_SET = CCM_ANALOG_PLL_USB1_POWER;
			continue;
		}
		if (!(n & CCM_ANALOG_PLL_USB1_LOCK)) {
			printf("  wait for lock\n");
			continue;
		}
		if (n & CCM_ANALOG_PLL_USB1_BYPASS) {
			printf("  turn off bypass\n");
			CCM_ANALOG_PLL_USB1_CLR = CCM_ANALOG_PLL_USB1_BYPASS;
			continue;
		}
		if (!(n & CCM_ANALOG_PLL_USB1_EN_USB_CLKS)) {
			printf("  enable USB clocks\n");
			CCM_ANALOG_PLL_USB1_SET = CCM_ANALOG_PLL_USB1_EN_USB_CLKS;
			continue;
		}
		return; // everything is as it should be  :-)
	}
}

